In [1]:
import pandas as pd

In [2]:
pd.DataFrame({"hello": [1,2]})

   hello
0      1
1      2

In [3]:
import os
import pandas as pd

pd.DataFrame({"name":['saitou','satou','itou','iijima'],"adress":['tokyou','nagoya','saitama','fukusima']})

     name    adress
0  saitou    tokyou
1   satou    nagoya
2    itou   saitama
3  iijima  fukusima

In [4]:
#呼び出し
import pandas as pd
df=pd.read_csv('traning_101.csv')
display(df)

     name    adress
0  saitou     tokyo
1   satou    nagoya
2    itou   saitama
3  iijima  fukusima

In [5]:
import pandas as pd
df=pd.read_csv('traning_101.csv')
df_2=df.loc[:,['name']]
display(df_2)

     name
0  saitou
1   satou
2    itou
3  iijima

In [20]:
#書き込み
import pandas as pd
df=pd.read_csv('traning_101.csv')
df['year_month']='202004'
display(df)

   Unnamed: 0    name    adress year_month
0           0  saitou     tokyo     202004
1           1   satou    nagoya     202004
2           2    itou   saitama     202004
3           3  iijima  fukusima     202004

In [21]:
#csvに出力
import pandas as pd
output_file='traning_101.csv'
df.to_csv(output_file)

In [18]:
df.to_csv("./sample.csv")

In [12]:
df

     name    adress year_month
0  saitou     tokyo     202004
1   satou    nagoya     202004
2    itou   saitama     202004
3  iijima  fukusima     202004

In [22]:
df=pd.read_csv('traning_101.csv')
df['day']='125'
display(df)

   Unnamed: 0.1  Unnamed: 0    name    adress  year_month  day
0             0           0  saitou     tokyo      202004  125
1             1           1   satou    nagoya      202004  125
2             2           2    itou   saitama      202004  125
3             3           3  iijima  fukusima      202004  125

In [23]:
#csvに書き込み
output_file='traning_101.csv'
df.to_csv(output_file)